import React from 'react'
import Sidebar from '../components/Sidebar';
function About() {
    return (
        <>
            <div className='flex'>
                <Sidebar />
                {/* <h1 className='m-8'>เว็บไซต์นี้จัดทำขึ้นเพื่อโครงงาน</h1> */}
                <div className='m-8'>
                    <h1 className='text-lg'>
                        หน้า Home
                    </h1>
                    <p className='text-wrap mt-4'>จะแสดงผลสถานะปัจจุบันของรถแต่ละคัน ว่าปัจจุบันอยู่สถานีไหน และมีจำนวนคนบนรถในปัจจุบันกี่คน
                        และจะแสดงผลการใช้งานของแต่ละสถานี โดยจะแสดงผลเป็นรูปวงกลม และมีสีเพื่อแสดงผลการใช้งาน หากเป็นสีแดงหมายถึงมีคนลงมากกว่าคนขึ้น
                        หากเป็นสีเขียวหมายถึงมีคนขึ้นมากกว่าคนลง</p>
                    <h1 className='text-lg mt-4'>
                        หน้า Record
                    </h1>
                    <h1 className='mt-4'>หน้า Record จะแสดงผลทั้งสถานีของแต่ละสาย และแสดงผลสถานะของรถแต่ละคัน โดยจะแสดงสถานีทั้งสาย โดยจะแสดงผลเป็นรูปวงกลม และมีสีเพื่อแสดงผลการใช้งาน
                        และมีการแสดงผลข้อมูลในอดีตออกมาเป็นตาราง โดยสามารถเลื่อนดูข้อมูลย้อนหลังได้สูงสุด 30 วัน</h1>
                </div>

            </div>
        </>
    )
}

export default About